In [47]:
import pandas as pd

In [ ]:
-- Create a DataFrame I

In [3]:
df1 = pd.DataFrame ({
    'Product ID' : [1,2,3,4],
    'Product Name' : ['t-shirt', 't-shirt', 'skirt', 'skirt'],
    'Color' : ['blue', 'green', 'red', 'black']
})

In [4]:
df1

   Product ID Product Name  Color
0           1      t-shirt   blue
1           2      t-shirt  green
2           3        skirt    red
3           4        skirt  black

In [ ]:
-- Create a DataFrame II

In [35]:
df2 = pd.DataFrame ([ 
    [1, 'San Diego', 100] ,
    [2, 'Los Angeles', 120],
    [3, 'San Francisco', 90],
    [4, 'Sacramento', 115]
    
],
columns=[ 
    "Store", "ID" , "Number of Employees"
])

In [36]:
print(df2)

   Store             ID  Number of Employees
0      1      San Diego                  100
1      2    Los Angeles                  120
2      3  San Francisco                   90
3      4     Sacramento                  115

In [ ]:
-- Loading and Saving CSVs

In [52]:
df = pd.read_csv ('project_inventory.csv')

In [54]:
df

         location  product_type         product_description  quantity  price
0   Staten Island         seeds                       daisy         4   6.99
1   Staten Island         seeds                  calla lily        46  19.99
2   Staten Island         seeds                      tomato        85  13.99
3   Staten Island  garden tools                        rake         4  13.99
4   Staten Island  garden tools                 wheelbarrow         0  89.99
5   Staten Island  garden tools                       spade        93  19.99
6   Staten Island  pest_control               insect killer        74  12.99
7   Staten Island  pest_control                 weed killer         8  23.99
8   Staten Island       planter  20 inch terracotta planter         0  17.99
9   Staten Island       planter      8 inch plastic planter        53   3.99
10       Brooklyn         seeds                       daisy        50   6.99
11       Brooklyn         seeds                  calla lily         0  19.99
12       Brooklyn         seeds                      tomato         0  13.99
13       Brooklyn  garden tools                        rake        15  13.99
14       Brooklyn  garden tools                 wheelbarrow        82  89.99
15       Brooklyn  garden tools                       spade        36  19.99
16       Brooklyn  pest_control               insect killer        80  12.99
17       Brooklyn  pest_control                 weed killer        76  23.99
18       Brooklyn       planter  20 inch terracotta planter         5  17.99
19       Brooklyn       planter      8 inch plastic planter        26   3.99
20         Queens         seeds                       daisy        57   6.99
21         Queens         seeds                  calla lily        95  19.99
22         Queens         seeds                      tomato        45  13.99
23         Queens  garden tools                        rake        21  13.99
24         Queens  garden tools                 wheelbarrow        98  89.99
25         Queens  garden tools                       spade        26  19.99
26         Queens  pest_control               insect killer         0  12.99
27         Queens  pest_control                 weed killer        16  23.99
28         Queens       planter  20 inch terracotta planter        87  17.99

In [ ]:
--  Inspect a DataFrame

In [56]:
df.head()

        location  product_type product_description  quantity  price
0  Staten Island         seeds               daisy         4   6.99
1  Staten Island         seeds          calla lily        46  19.99
2  Staten Island         seeds              tomato        85  13.99
3  Staten Island  garden tools                rake         4  13.99
4  Staten Island  garden tools         wheelbarrow         0  89.99

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   location             29 non-null     object
 1   product_type         29 non-null     object
 2   product_description  29 non-null     object
 3   quantity             29 non-null     int64
 4   price                29 non-null     float64
dtypes: float64(1), int64(1), object(3)
memory usage: 1.3+ KB

In [117]:
df = pd.DataFrame(
[
    ['January', 100, 100, 23, 100],
    ['February', 51, 45, 145, 45],
    ['March', 81, 96, 65, 96],
    ['April', 80, 80, 54, 180],
    ['May', 51, 54, 54, 154],
    ['June', 112, 109, 79, 129]
],
    columns=['month', 'clinic_east', 'clinic_north', 'clinic_south', 'clinic_west']
)

In [118]:
df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [ ]:
-- Select Columns

In [60]:
clinic_north = df.clinic_north

In [65]:
clinic_north

(0    100
 1     45
 2     96
 3     80
 4     54
 5    109
 Name: clinic_north, dtype: int64,
 0     23
 1    145
 2     65
 3     54
 4     54
 5     79
 Name: clinic_south, dtype: int64)

In [62]:
print(type(clinic_north))

<class 'pandas.core.series.Series'>

In [63]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
-- Selecting Multiple Columns

In [66]:
clinic_north_south = df.clinic_north,  df.clinic_south

In [67]:
clinic_north_south

(0    100
 1     45
 2     96
 3     80
 4     54
 5    109
 Name: clinic_north, dtype: int64,
 0     23
 1    145
 2     65
 3     54
 4     54
 5     79
 Name: clinic_south, dtype: int64)

In [70]:
new_df = df[['clinic_north', 'clinic_south']]

In [71]:
new_df

   clinic_north  clinic_south
0           100            23
1            45           145
2            96            65
3            80            54
4            54            54
5           109            79

In [ ]:
-- Select Rows

In [79]:
april = df.iloc[3]

In [80]:
april

month           April
clinic_east        80
clinic_north       80
clinic_south       54
clinic_west       180
Name: 3, dtype: object

In [78]:
march = df.iloc[2]

In [81]:
march

month           March
clinic_east        81
clinic_north       96
clinic_south       65
clinic_west        96
Name: 2, dtype: object

In [82]:
df = pd.read_csv ('project_inventory.csv')

In [83]:
df

         location  product_type         product_description  quantity  price
0   Staten Island         seeds                       daisy         4   6.99
1   Staten Island         seeds                  calla lily        46  19.99
2   Staten Island         seeds                      tomato        85  13.99
3   Staten Island  garden tools                        rake         4  13.99
4   Staten Island  garden tools                 wheelbarrow         0  89.99
5   Staten Island  garden tools                       spade        93  19.99
6   Staten Island  pest_control               insect killer        74  12.99
7   Staten Island  pest_control                 weed killer         8  23.99
8   Staten Island       planter  20 inch terracotta planter         0  17.99
9   Staten Island       planter      8 inch plastic planter        53   3.99
10       Brooklyn         seeds                       daisy        50   6.99
11       Brooklyn         seeds                  calla lily         0  19.99
12       Brooklyn         seeds                      tomato         0  13.99
13       Brooklyn  garden tools                        rake        15  13.99
14       Brooklyn  garden tools                 wheelbarrow        82  89.99
15       Brooklyn  garden tools                       spade        36  19.99
16       Brooklyn  pest_control               insect killer        80  12.99
17       Brooklyn  pest_control                 weed killer        76  23.99
18       Brooklyn       planter  20 inch terracotta planter         5  17.99
19       Brooklyn       planter      8 inch plastic planter        26   3.99
20         Queens         seeds                       daisy        57   6.99
21         Queens         seeds                  calla lily        95  19.99
22         Queens         seeds                      tomato        45  13.99
23         Queens  garden tools                        rake        21  13.99
24         Queens  garden tools                 wheelbarrow        98  89.99
25         Queens  garden tools                       spade        26  19.99
26         Queens  pest_control               insect killer         0  12.99
27         Queens  pest_control                 weed killer        16  23.99
28         Queens       planter  20 inch terracotta planter        87  17.99

In [ ]:
-- Selecting Multiple Rows

In [89]:
april_may_june = df.iloc[3:7]

In [90]:
april_may_june

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

In [ ]:
-- Select Rows with Logic I

In [103]:
january = df[df.month == 'January']

In [104]:
january

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100

In [ ]:
-- SELECT ROWS WITH LOGIC II (|{OR}, &{AND} )

In [110]:
march_april = df[(df.month == 'March') | (df.month == 'April')]

In [111]:
march_april

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

In [138]:
df = pd.DataFrame(
[
    ['January', 100, 100, 23, 100],
    ['February', 51, 45, 145, 45],
    ['March', 81, 96, 65, 96],
    ['April', 80, 80, 54, 180],
    ['May', 51, 54, 54, 154],
    ['June', 112, 109, 79, 129]
],
    columns=['month', 'clinic_east', 'clinic_north', 'clinic_south', 'clinic_west']
)

In [139]:
df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [ ]:
-- SELECT ROWS WITH LOGIC III (isin)

In [127]:
januari_february_march = df[df.month.isin(['January',
                                          'February',
                                          'March'])]

In [128]:
januari_february_march

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96

In [ ]:
-- SETTING INDICES

In [185]:
df2 = df.loc[[1,3,5]]
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

In [ ]:
-- RESET INDEX -> df.reset_index()

In [186]:
df3 = df2.reset_index()

In [187]:
df3

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      3     April           80            80            54          180
2      5      June          112           109            79          129

In [189]:
df2 = df2.reset_index (drop = True)

In [190]:
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1     April           80            80            54          180
2      June          112           109            79          129

In [ ]:
orders = pd.read_csv ('shoefly.csv')

In [ ]:
orders.head(5)

In [ ]:
emails = orders.email

In [ ]:
frances_palmer = orders[(orders.first_name == 'frances') & (orders.last_name == 'palmer')]

In [ ]:
comfy_shoes = orders[orders.shoe_type.isin(['clogs',
                                          'boots',
                                          'ballet flats'])]